InformationRegisters/НДССостояниеРеализации0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НДССостояниеРеализации0</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДССостоянияРеализация0</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПервичныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРеализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/НДСПредъявленный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>НДСПредъявленный</Name>
			<Comment> НДС, предъявляемый поставщиком</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияНДСПредъявленный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентнаяОперация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СчетФактура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсправленныйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПриобретения</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученныйНалоговыйАгент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеализацияЭкспорт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПервичныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗаданияКФормированиюЗаписейКнигиПокупокПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияКФормированиюЗаписейКнигиПокупокПродаж</Name>
			<Comment>Технический регистр. Содержит в себе данные о документах учета входящего НДС, по которым необходимо сформировать записи книги покупок и продаж</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗадания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НДССостоянияРеализация0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>НДССостоянияРеализация0</Name>
			<Comment>НДС состояния по реализации со ставкой НДС 0%</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПодтверждение</Name>
					<Comment>Ожидается подтверждение 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвержденаРеализация0</Name>
					<Comment>Подтверждена реализация 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодтвержденаРеализация0</Name>
					<Comment>Не подтверждена реализация 0%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОперацииЗакрытияМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ОперацииЗакрытияМесяца</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АннулированиеПодарочныхСертификатов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчетовУчетаДоходовИРасходовМУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсправлениеДублейВидовЗапасов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсправлениеОтрицательныхОстатковТоваровОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсправлениеОшибокВИсходныхДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкаРаспределенияРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеАмортизацииНМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеАмортизацииОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеАмортизацииОСиНМАМеждународныйУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеОценочныхОбязательствРезервовПоОтпускам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачисленияПоКредитамДепозитамИВыданнымЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтражениеДокументовВМеждународномУчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтражениеДокументовВРегламентированномУчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтражениеЗарплатыВФинансовомУчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеВыкупаТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеВыработкиСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеОстатковТоваровКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеОтчетовКомитентамОСписании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеОтчетовПоКомиссииМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеПередачМатериаловВПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеПередачТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеПроизводстваБезЗаказов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСчетовФактурИТаможенныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаДенежныхСредствКредитовДепозитовЗаймов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНДСВБюджетПоОтдельнымОперациям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСтоимостиТМЦВЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеВНалоговомУчетеЛизинговыхПлатежей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеРасходовПриУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеДоходовИРасходовПоНаправлениямДеятельности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеМатериаловИРаботНаСебестоимостьПродукции21</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеМатериаловИРаботНаСебестоимостьПродукции22</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовБудущихПериодов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетЗемельногоНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетКурсовыхРазниц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетКурсовыхРазницВВалютеПредставления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетКурсовыхРазницВФункциональнойВалюте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаНаИмущество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПартийИСебестоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетСтоимостиВнеоборотныхАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТорговогоСбора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТранспортногоНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЗатратНаВыпускБезРаспоряжений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторноДоходовКУДиР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАмортизацияОС</Name>
					<Comment>Использовалось до версии 2.4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаДатыЗапретаФормированияПроводокМУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеДвиженийПоВнеоборотнымАктивам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеРезервовПоСомнительнымДолгам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеФинансовогоРезультата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НДССостояниеРеализации0/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НДССостояниеРеализации0.ДокументРеализации КАК ДокументРеализации,
	|	НДССостояниеРеализации0.Организация КАК Организация,
	|	НДССостояниеРеализации0.ДатаПодтверждения КАК ДатаПодтверждения,
	|	НДССостояниеРеализации0.Состояние КАК Состояние
	|ПОМЕСТИТЬ НДССостояниеРеализации0ПередЗаписью
	|ИЗ
	|	РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|ГДЕ
	|	НДССостояниеРеализации0.Регистратор = &Регистратор
	|";
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.ДатаПодтверждения    КАК ДатаПодтверждения,
	|	Таблица.ДокументРеализации   КАК ДокументРеализации,
	|	Таблица.Организация          КАК Организация
	|ПОМЕСТИТЬ ВтИзменения
	|ИЗ
	|	(ВЫБРАТЬ
	|		НДССостояниеРеализации0.ДокументРеализации КАК ДокументРеализации,
	|		НДССостояниеРеализации0.ДатаПодтверждения КАК ДатаПодтверждения,
	|		НДССостояниеРеализации0.Организация КАК Организация,
	|		ВЫБОР
	|			КОГДА НДССостояниеРеализации0.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение)
	|				ТОГДА 1
	|			КОГДА НДССостояниеРеализации0.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ПодтвержденаРеализация0)
	|				ТОГДА 2
	|			КОГДА НДССостояниеРеализации0.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.НеПодтвержденаРеализация0)
	|				ТОГДА 3
	|		КОНЕЦ КАК Состояние
	|	ИЗ
	|		НДССостояниеРеализации0ПередЗаписью КАК НДССостояниеРеализации0
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДССостояниеРеализации0.ДокументРеализации КАК ДокументРеализации,
	|		НДССостояниеРеализации0.ДатаПодтверждения КАК ДатаПодтверждения,
	|		НДССостояниеРеализации0.Организация КАК Организация,
	|		-(ВЫБОР
	|			КОГДА НДССостояниеРеализации0.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение)
	|				ТОГДА 1
	|			КОГДА НДССостояниеРеализации0.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ПодтвержденаРеализация0)
	|				ТОГДА 2
	|			КОГДА НДССостояниеРеализации0.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.НеПодтвержденаРеализация0)
	|				ТОГДА 3
	|		КОНЕЦ) КАК Состояние
	|	ИЗ
	|		РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|	ГДЕ
	|		НДССостояниеРеализации0.Регистратор = &Регистратор) Таблица
	|ГДЕ
	|	Таблица.ДатаПодтверждения <> ДАТАВРЕМЯ(1,1,1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.ДатаПодтверждения,
	|	Таблица.ДокументРеализации,
	|	Таблица.Организация
	|
	|ИМЕЮЩИЕ
	|	СУММА(Таблица.Состояние) <> 0
	|;
	|///////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Таблица.ДатаПодтверждения, КВАРТАЛ), МЕСЯЦ) КАК Месяц,
	|	Таблица.ДокументРеализации                                             КАК Документ,
	|	Таблица.Организация                                                    КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.РаспределениеНДС)         КАК Операция
	|ПОМЕСТИТЬ НДССостояниеРеализации0ЗаданияКЗакрытиюМесяца
	|ИЗ
	|	ВтИзменения КАК Таблица
	|;
	|
	|///////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(Таблица.ДатаПодтверждения, МЕСЯЦ) КАК Месяц,
	|	Таблица.Организация                             КАК Организация,
	|	НДСПредъявленный.СчетФактура                    КАК СчетФактура
	|ИЗ
	|	ВтИзменения КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|	ПО
	|		Таблица.Организация = НДСПредъявленный.Организация
	|		И Таблица.ДокументРеализации = НДСПредъявленный.РеализацияЭкспорт
	|";
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[2].Выбрать();
	РегистрыСведений.ЗаданияКФормированиюЗаписейКнигиПокупокПродаж.СоздатьЗаписиРегистраПоДаннымВыборки(Выборка);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
